/************************************************************
参考URL
	switch文の途中で宣言する
		https://konuma.org/blog/2005/11/17/switch_64b8/
		
	switch文内での変数の宣言によるエラー
		http://qiita.com/John_Doe_113/items/b37865e42ce918382158
************************************************************/
#include <stdio.h>


/************************************************************
define
************************************************************/
#define PATTERN 1


/************************************************************
function
************************************************************/

/******************************
warningは出るがcompileは通る.
要注意pattern.

switch ブロックの最初の case 文より前で条件式の使用や変数の初期化を行うと、プログラムの予期せぬ動作や未定義の動作を引き起こす可能性がある。
コンパイラによっては、warningを出すのみだが、少なくとも、初期化はされない(通らないので)
******************************/
#if PATTERN == 0
int main()
{
	int sw = 0;
	
	switch(sw){
		/********************
		code will never be executed.
			switch直後の飛び先が、間を飛ばして、すぐcase文なので、ここは通らない.
			すると、「scopeはswitch()文内なのに、定義がされない」
			と言うおかしなことになる.
			
			compilerによっては、Errorとせず、warningのみ出すが、
			少なくとも、初期化はされない(通過しないので).
		********************/
		int dt;
		// int dt = 99;
		
		case 0:
			dt = 100;
			printf("0:dt = %d\n", dt);
			break;
			
		case 1:
			printf("1\n");
			break;
	}

	
	return 0;
}

/******************************
compile Error.

case 0: int dt = 100; のスコープは、switch block全体.
but...例えば、case 1:の時、scope内にも関わらず、int dt;の定義文を通ってない.
∴compilerはErrorとせざるを得ない.
******************************/
#elif PATTERN == 1
int main()
{
	int sw = 0;
	
	switch(sw){
		case 0:
		// { // 括弧をつけるとOK.
			int dt = 100;
			printf("0:dt = %d\n", dt);
			break;
		// }
			
		case 1:
			printf("1\n");
			break;
	}

	
	return 0;
}

/******************************
******************************/
#endif
